# 두 배열의 원소 교체
# 문제 설명:
#   동빈이는 두 개의 배열 A와 B를 가지고 있다. 두 배열은 N개의 원소로 구성되어 있으며, 배열의 원소는 모두 자연수이다.
#   동빈이는 최대 K번의 바꿔치지 연산을 수행할 수 있는데, 바꿔치기 연산이란 배열 A에 있는 원소 하나와 배열 B에 있는 원소 하나를  골라서 두 원소를 서로 바꾸는 것을 말한다.
#   동빈이의 최종 목표는 배열 A의 모든 원소의 합이 최대가 되도록 하는 것이며, 여러분은 동빈이를 도와야 한다.
#   N, K, 그리고 배열 A와 B의 정보가 주어졌을 때, 최대 K번의 바궈치기 연산을 수행하여 만들 수 있는 배열 A의 모든 원소의 합의 최댓값을 출력하는 프로그램을 작성해라.
#   예를 들어 N = 5, K = 3이고, 배열 A와 B가 다음과 같다고 하자.
#       배열 A = [1, 2, 5, 4, 3]
#       배열 B = [5, 5, 6, 6, 5]
#   이 경우, 다음과 같이 세 번의 연산을 수행할 수 있다.
#       연산 1) 배열 A의 원소 '1'과 배열 B의 원소 '6'을 바꾸기
#       연산 2) 배열 A의 원소 '2'와 배열 B의 원소 '6'을 바꾸기
#       연산 3) 배열 A의 원소 '3'과 배열 B의 원소 '6'을 바꾸기
#   세 번의 연산 이후 배열 A와 배열 B의 상태는 다음과 같이 구성될 것이다.
#       배열 A = [6, 6, 5, 4, 5]
#       배열 B = [3, 5, 1, 2, 5]
#   이때 배열 A의 모든 원소의 합은 26이 되며, 이보다 더 합을 크게 만들 수는 없다.
# 문제 조건:
#   풀이 시간: 15분, 시간 제한: 2초, 메모리 제한: 128MB
# 입력 조건:
#   1. 첫 번째 줄에 N, K가 공백을 기준으로 구분되어 입력됨. (1 <= N <= 100,000, 0 <= K <= N)
#   2. 두 번째 줄에 배열 A의 원소들이 공백을 기준으로 구분되어 입력됨. 모든 원소는 10,000,000 보다 작은 자연수이다.
#   3. 세 번째 줄에 배열 B의 원소들이 공백을 기준으로 구분되어 입력됨. 모든 원소는 10,000,000 보다 작은 작연수이다.
# 츌력 조건:
#   최대 K번의 바꿔치기 연산을 수행하여 만들 수 있는 배열 A의 모든 원소의 합의 최댓값을 출력함.




# 1. 배열 A와 배열 B를 각각 정렬
# 2. 배열 A에서 가장 작은 원소와 배열 B에서 가장 큰 원소 하나씩 선택 후 서로 바꿈
# 시간 복잡도가 O(N^2)일 경우, 100,000 ^ 2 = 10,000,000,000 의 계산량이 됨. 그럼 2초를 초과하므로 더 빠른 알고리즘으로 해결해야함.


n, k = map(int, input().split())
a = list(map(int, input().split()))
b = list(map(int, input().split()))

# O(NlongN)인 기본 라이브러리로 정렬
a.sort()
b.sort(reverse=True)

for i in range(k): 
    if a[i] < b[i]:
        a[i], b[i] = b[i], a[i]
    else:   # A의 원소가 B 원소 보다 클 경우, 더 이상 바꿀 필요가 없으니 반복문 탈출
        break

print(sum(a))